public/IT/Docwriting/Sysanalyses/Notation/UML/CompositeStructure/README.md
```
flowchart TB
    subgraph ApplicationService["ApplicationService"]
        PortIn((request))
        PortOut((event))
        ApplicationCore[ApplicationCore]
        Repository[Repository]

        PortIn --> ApplicationCore
        ApplicationCore --> Repository
        ApplicationCore --> PortOut
    end
```
